---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Gutter.GutterType
source: html/75fe8039-cddc-a565-ee2a-9833c24114a9.htm
---
# Autodesk.Revit.DB.Architecture.Gutter.GutterType Property

Retrieves/set an object that represents the type of the Gutter.

## Syntax (C#)
```csharp
public GutterType GutterType { get; set; }
```